/*
####### sdk.application (c) 2024 Archivage Numérique ############################################### MIT License #######
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
*/

package component

type (
	Component interface {
		Name() string
		Value() any
		Build() error
		Start() error
		Stop() error
		Close() error
	}
)

/*
####### END ############################################################################################################
*/
